[
  { "timestamp": "2025-07-03 18:01:53", "entry": "This is the sixth entry" },
  { "timestamp": "2025-07-03 18:02:39", "entry": "This is the seventh entry" },
  { "timestamp": "2025-07-03 18:03:07", "entry": "This is the eighth entry" },
  {
    "timestamp": "2025-07-03 18:03:49",
    "entry": "<h1>Hurray</h1><p>If everything goes fine, this time, it will run really well</p>"
  },
  {
    "timestamp": "2025-07-03 18:52:21",
    "entry": "<h1>Finally</h1><p>This marks a new start of my new journey on build in public. Somehow, now I'll only upload on this platform. To access this, go onto <i>mark-up-journal.vercel.app</i> &lt;tu&gt;</p>"
  },
  {
    "timestamp": "2025-07-03 19:05:18",
    "entry": "<h2>This is to create and push the readme file</h2> <p>Everytime I push something from VS Code it creates a new master branch and pushes everything to it. I don't wanns go and merger again and again from github, so trying and checking if it pushes everything from this script or not. $lt;tu&gt;</p>"
  },
  {
    "timestamp": "2025-07-03 19:09:39",
    "entry": "<h1>Edit the readme on github</h1>I'll need to come back and edit the readme of this project sometime. Right now it is based on what gemini gave at the start. I'll need to optimize according to the new updates and the final project. <i>And yeah... I'm talking about the markUpJournal project</i>"
  },
  {
    "timestamp": "2025-07-04 16:39:15",
    "entry": "<p>Ok, this seems real fun to havet his kind of journal but, I'd also like to add a few more features in the future... like, <ul><li>Add a really good UI to add entries</li> <li>Make it public </li> <li>Make an option that makes all the entries visible as a story in a signle go </li></ul> <i>I'll leave that here for now and come back again in case I have new ideas. </i> </p>"
  },
  {
    "timestamp": "2025-07-04 18:14:25",
    "entry": "<h1>I am showing this to shubham sir</h1>"
  },
  {
    "timestamp": "2025-07-04 18:15:52",
    "entry": "Meh, showed this to shubham sir but the reaction was mid. Anyways, onto the next thing."
  },
  {
    "timestamp": "2025-07-04 18:17:29",
    "entry": "<h3> Bored of everything...<h3> <p>Want something real fun to build now. <br><br>Showed some of my stuff to Harpal Sir and he was okishly impressed. Guess so, he is real experienced person and his insights are really valuable </p>"
  },
  {
    "timestamp": "2025-07-04 18:19:49",
    "entry": "I really need to test with a lot of stuff... and get the hang of it too. <br> Other than this, I should also be optimising this a bit. The results UI is ok but really needs a lot of refinment. Guess, I'll just go with some AI tool to do so."
  },
  {
    "timestamp": "2025-07-04 18:20:44",
    "entry": "<strong>Does this text get bold... </strong>"
  },
  {
    "timestamp": "2025-07-04 18:25:02",
    "entry": "Great, the text does get bold. After this I shall get my things straight. <br> First of all, I should streamline my day process and tasks accordungly. <br> <br> <i>Did I study my MERN today... <b>NO</b> </i> <br>  <i>Did I study my DSA today... <b> NO </b> <br> Did I study my Python today... <b>NO </b>  <b> Wait </b> Did I study my Python Yesterday... <b>NO </b></i> A real big NO. <br> Shit! Things are really getting out of hands. Gotta get them to straighten out a bit fast"
  },
  {
    "timestamp": "2025-07-04 18:29:37",
    "entry": "First thing first, Go home and study some MERN. That interests me <br> After that, go home and study... I guess python next. <br> After that, I won't have much time. I guess I should move to academics. You know what, this is also something I should start roght now. Maths or Automata, whatever..."
  },
  {
    "timestamp": "2025-07-05 18:34:19",
    "entry": "Ok, so did noting so far today. The day's has been dedicated to proper resting, that's it. Now, going out for a walk and some snacks. Will come back later and see what can we do."
  },
  {
    "timestamp": "2025-07-06 01:55:20",
    "entry": "Though I have taken a break from LeetCode but I still did my question today. <br> Still, a lot confused, what should I do? I don't wanna waste it all and increase this much epentation. It just doesn't feel right. Breaking the streak also doesn't feel good. <br> <br> <h1> Ok, Let'e keep the sreak</h1> <br> Guess I'll just maintain the streak and not do the questions. Will get the days badge and nothing else. Also, the sterak look really good <hehe>"
  },
  {
    "timestamp": "2025-07-06 23:11:27",
    "entry": "had a great day today. Met tauji and discussed more about our idea. Have a really clear picture in mind and will really start working on it. Next up I need to carry my leetcode streak and just push a previous question, as usual."
  },
  {
    "timestamp": "2025-07-07 14:30:55",
    "entry": "Ok, start of a new day, what I'll be doing today will be first off, DSA leetcode push and then, some DSA learning only. After that moving to Python. <br> <i>Let the fun begin </i>"
  },
  {
    "timestamp": "2025-07-07 14:33:05",
    "entry": "<h3>From now on, I won't be calling it as some days or day of week or something the date or what so ever. </h3> Every day is out there to have and enjoy life at the fullest. And so, day should be called as \"fun\". Some funs are not that fun and some funs are really fun. This is the thing. Today's the target is to have a lot of fun."
  },
  {
    "timestamp": "2025-07-07 15:19:55",
    "entry": "<h1>We are not gonna see each other again</h1>Yesterday I met someone in the metro, a graphic designer starting hie career. He is originally from Odisha but was working somewhere in Gurgaon. He was a really nice guy, though a bit shy from nature but when I took the first few moves to start a conve, he really picked them up nicely and we had a good time knowing each other till We reached my station. Funny part of all, while departing, he asked me for my name and I said, \"Why do you wanna know the name when we are not gonna meet ever again.\" After that we both kinda smikerd and I lifted my hand for a hand shake and saying my name. He said, \"Suraj\" and we both parted ways."
  },
  {
    "timestamp": "2025-07-07 16:22:23",
    "entry": "Showing thie project to Raghav Anna"
  },
  {
    "timestamp": "2025-07-07 16:24:54",
    "entry": "<h1>This is heading </h1> <br> <ul> <li> This is list item 1 </li> <li> This is list item 2 </li> </ul>"
  },
  {
    "timestamp": "2025-07-07 23:29:02",
    "entry": "A lot of things happened. <br> Got in a disscussion with Lovely Bhaiya, my current PG owner. now, I need to change my room after two days. Not that of a deal. Though I've made sure... more like I need to make sure that the rent remain to half as that of the month only.<br> <br> Now, about the study and the fun I had sp far is simply the bubble sort. It does feel good to code in the father language, <b>C</b>. Next up is Insertion sort.<br><br> Also my roommate told, more like advised me, to focus more on DSA so, that's the thing."
  },
  {
    "timestamp": "2025-07-08 14:31:44",
    "entry": "this is another test entry to see if it automatially enters the comma after another entry is appended."
  }
,{"timestamp": "2025-07-08 14:34:13", "entry": "There;'s some error in the entry. Trying once more"},]